MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV32GM102/mcu.h
#define _RPOR11_RP177R5_POSITION                 0x00000005
#define _RPOR11_RP177R5_MASK                     0x00000020
#define _RPOR11_RP177R5_LENGTH                   0x00000001

#define _RPOR11_RP178R0_POSITION                 0x00000008
#define _RPOR11_RP178R0_MASK                     0x00000100
#define _RPOR11_RP178R0_LENGTH                   0x00000001

#define _RPOR11_RP178R1_POSITION                 0x00000009
#define _RPOR11_RP178R1_MASK                     0x00000200
#define _RPOR11_RP178R1_LENGTH                   0x00000001

#define _RPOR11_RP178R2_POSITION                 0x0000000A
#define _RPOR11_RP178R2_MASK                     0x00000400
#define _RPOR11_RP178R2_LENGTH                   0x00000001

#define _RPOR11_RP178R3_POSITION                 0x0000000B
#define _RPOR11_RP178R3_MASK                     0x00000800
#define _RPOR11_RP178R3_LENGTH                   0x00000001

#define _RPOR11_RP178R4_POSITION                 0x0000000C
#define _RPOR11_RP178R4_MASK                     0x00001000
#define _RPOR11_RP178R4_LENGTH                   0x00000001

#define _RPOR11_RP178R5_POSITION                 0x0000000D
#define _RPOR11_RP178R5_MASK                     0x00002000
#define _RPOR11_RP178R5_LENGTH                   0x00000001

#define _RPOR12_RP179R_POSITION                  0x00000000
#define _RPOR12_RP179R_MASK                      0x0000003F
#define _RPOR12_RP179R_LENGTH                    0x00000006

#define _RPOR12_RP180R_POSITION                  0x00000008
#define _RPOR12_RP180R_MASK                      0x00003F00
#define _RPOR12_RP180R_LENGTH                    0x00000006

#define _RPOR12_RP179R0_POSITION                 0x00000000
#define _RPOR12_RP179R0_MASK                     0x00000001
#define _RPOR12_RP179R0_LENGTH                   0x00000001

#define _RPOR12_RP179R1_POSITION                 0x00000001
#define _RPOR12_RP179R1_MASK                     0x00000002
#define _RPOR12_RP179R1_LENGTH                   0x00000001

#define _RPOR12_RP179R2_POSITION                 0x00000002
#define _RPOR12_RP179R2_MASK                     0x00000004
#define _RPOR12_RP179R2_LENGTH                   0x00000001

#define _RPOR12_RP179R3_POSITION                 0x00000003
#define _RPOR12_RP179R3_MASK                     0x00000008
#define _RPOR12_RP179R3_LENGTH                   0x00000001

#define _RPOR12_RP179R4_POSITION                 0x00000004
#define _RPOR12_RP179R4_MASK                     0x00000010
#define _RPOR12_RP179R4_LENGTH                   0x00000001

#define _RPOR12_RP179R5_POSITION                 0x00000005
#define _RPOR12_RP179R5_MASK                     0x00000020
#define _RPOR12_RP179R5_LENGTH                   0x00000001

#define _RPOR12_RP180R0_POSITION                 0x00000008
#define _RPOR12_RP180R0_MASK                     0x00000100
#define _RPOR12_RP180R0_LENGTH                   0x00000001

#define _RPOR12_RP180R1_POSITION                 0x00000009
#define _RPOR12_RP180R1_MASK                     0x00000200
#define _RPOR12_RP180R1_LENGTH                   0x00000001

#define _RPOR12_RP180R2_POSITION                 0x0000000A
#define _RPOR12_RP180R2_MASK                     0x00000400
#define _RPOR12_RP180R2_LENGTH                   0x00000001

#define _RPOR12_RP180R3_POSITION                 0x0000000B
#define _RPOR12_RP180R3_MASK                     0x00000800
#define _RPOR12_RP180R3_LENGTH                   0x00000001

#define _RPOR12_RP180R4_POSITION                 0x0000000C
#define _RPOR12_RP180R4_MASK                     0x00001000
#define _RPOR12_RP180R4_LENGTH                   0x00000001

#define _RPOR12_RP180R5_POSITION                 0x0000000D
#define _RPOR12_RP180R5_MASK                     0x00002000
#define _RPOR12_RP180R5_LENGTH                   0x00000001

#define _RPOR13_RP181R_POSITION                  0x00000000
#define _RPOR13_RP181R_MASK                      0x0000003F
#define _RPOR13_RP181R_LENGTH                    0x00000006

#define _RPOR13_RP181R0_POSITION                 0x00000000
#define _RPOR13_RP181R0_MASK                     0x00000001
#define _RPOR13_RP181R0_LENGTH                   0x00000001

#define _RPOR13_RP181R1_POSITION                 0x00000001
#define _RPOR13_RP181R1_MASK                     0x00000002
#define _RPOR13_RP181R1_LENGTH                   0x00000001

#define _RPOR13_RP181R2_POSITION                 0x00000002
#define _RPOR13_RP181R2_MASK                     0x00000004
#define _RPOR13_RP181R2_LENGTH                   0x00000001

#define _RPOR13_RP181R3_POSITION                 0x00000003
#define _RPOR13_RP181R3_MASK                     0x00000008
#define _RPOR13_RP181R3_LENGTH                   0x00000001

#define _RPOR13_RP181R4_POSITION                 0x00000004
#define _RPOR13_RP181R4_MASK                     0x00000010
#define _RPOR13_RP181R4_LENGTH                   0x00000001

#define _RPOR13_RP181R5_POSITION                 0x00000005
#define _RPOR13_RP181R5_MASK                     0x00000020
#define _RPOR13_RP181R5_LENGTH                   0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x0000FF00
#define _RPINR0_INT1R_LENGTH                     0x00000008

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR0_INT1R5_POSITION                  0x0000000D
#define _RPINR0_INT1R5_MASK                      0x00002000
#define _RPINR0_INT1R5_LENGTH                    0x00000001

#define _RPINR0_INT1R6_POSITION                  0x0000000E
#define _RPINR0_INT1R6_MASK                      0x00004000
#define _RPINR0_INT1R6_LENGTH                    0x00000001

#define _RPINR0_INT1R7_POSITION                  0x0000000F
#define _RPINR0_INT1R7_MASK                      0x00008000
#define _RPINR0_INT1R7_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x000000FF
#define _RPINR1_INT2R_LENGTH                     0x00000008

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

#define _RPINR1_INT2R5_POSITION                  0x00000005
#define _RPINR1_INT2R5_MASK                      0x00000020
#define _RPINR1_INT2R5_LENGTH                    0x00000001

